Тест/Тест/src/AccumulationRegisters/РегистрНакопления1/РегистрНакопления1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрНакопления1</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Documents/Рас_Комплектовка/Рас_Комплектовка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рас_Комплектовка</name>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеКомплектовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </attributes>
  <attributes>
    <name>Полная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальПродана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>EnumRef.ПринадлежностьДетали</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураСписок</name>
    <attributes>
      <name>Номенклатураспис</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.Стеллаж</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДетали</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаботыСписок</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.АвтоРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусРаботы</name>
      <type>
        <types>EnumRef.СостояниеВосстановленияДетали</types>
      </type>
    </attributes>
    <attributes>
      <name>Нормочас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполненияРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрока</name>
      <comment>Для записи идентификатора в тип строка (для запроса)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНорм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/РегистрНакопления1/ManagerModule.bsl
Функция ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад) Экспорт
	
	///+ГомзМА 03.02.2023 (Задача 000002611 от 27.01.2023)
	Результат = Ложь;
	Граница = Новый Граница(Дата, ВидГраницы.Включая);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрНакопления1Остатки.Товар КАК Товар,
		|	РегистрНакопления1Остатки.Склад КАК Склад,
		|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрНакопления1Остатки.индкод КАК индкод,
		|	РегистрНакопления1Остатки.машина КАК машина
		|ИЗ
		|	РегистрНакопления.РегистрНакопления1.Остатки(
		|			&Дата,
		|			Склад = &Склад
		|				И (Товар, индкод, машина) В
		|					(ВЫБРАТЬ
		|						Рас_КомплектовкаНоменклатураСписок.Номенклатураспис КАК Номенклатураспис,
		|						Рас_КомплектовкаНоменклатураСписок.Номенклатураспис.Код КАК НоменклатурасписКод,
		|						Рас_КомплектовкаНоменклатураСписок.Автомобиль КАК Автомобиль
		|					ИЗ
		|						Документ.Рас_Комплектовка.НоменклатураСписок КАК Рас_КомплектовкаНоменклатураСписок
		|					ГДЕ
		|						Рас_КомплектовкаНоменклатураСписок.Ссылка.Ссылка = &Ссылка)) КАК РегистрНакопления1Остатки
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток < 0";
	
	Запрос.УстановитьПараметр("Дата", Граница);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаВывода = СтрШаблон("Не хватает товара %1 на складе %2 в количестве %3", Выборка.Товар, Выборка.Склад, -Выборка.КолвоОстаток);
			Сообщить(СтрокаВывода);
		КонецЦикла;
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	///-ГомзМА 03.02.2023 (Задача 000002611 от 27.01.2023)
	
КонецФункции //ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад)


Функция ЕстьОтрицательныеОстаткиВерсия2(Ссылка,Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рас_КомплектовкаНоменклатураСписок.Номенклатураспис КАК Товар,
		|	Рас_КомплектовкаНоменклатураСписок.Партия КАК индкод,
		|	Рас_КомплектовкаНоменклатураСписок.Автомобиль КАК машина,
		|	Рас_КомплектовкаНоменклатураСписок.Склад КАК Склад,
		|	Рас_КомплектовкаНоменклатураСписок.Количество КАК Колво
		|ПОМЕСТИТЬ ВТ_Расскомплектовка
		|ИЗ
		|	Документ.Рас_Комплектовка.НоменклатураСписок КАК Рас_КомплектовкаНоменклатураСписок
		|ГДЕ
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрНакопления1Остатки.Товар,
		|	РегистрНакопления1Остатки.индкод,
		|	РегистрНакопления1Остатки.Склад,
		|	РегистрНакопления1Остатки.машина,
		|	РегистрНакопления1Остатки.КолвоОстаток
		|ИЗ
		|	РегистрНакопления.РегистрНакопления1.Остатки(&Дата, (Товар, индкод, Склад, машина) В
		|		(ВЫБРАТЬ
		|			Т.Товар КАК Товар,
		|			Т.индкод КАК индкод,
		|			Т.Склад КАК Склад,
		|			Т.машина КАК машина
		|		ИЗ
		|			ВТ_Расскомплектовка КАК Т)) КАК РегистрНакопления1Остатки
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток < 0";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 

	Если НЕ РезультатЗапроса.Пустой() Тогда 
	
		Пока Выборка.Следующий() Цикл
				СтрокаВывода = СтрШаблон("Не хватает товара %1 на складе %2 в количестве %3", Выборка.Товар, Выборка.Склад, -Выборка.КолвоОстаток);
				Сообщение  = Новый СообщениеПользователю();
				Сообщение.Текст = СтрокаВывода; 
				Сообщение.Сообщить();
		КонецЦикла;

		Результат =  Истина; 
	Иначе 
		Результат =  Ложь; 
	КонецЕсли; 
	
	Возврат Результат;  
КонецФункции
